
// Задача
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

// Рішення

// let number = prompt("Введіть число");
// console.log(number);
// number = Number(number);
// if (number === 10) {
//     alert("Вірно");
// } else {
//     alert("Невірно");
// }



// Задача
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// Рішення

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// let querty;

// if (min => 0 && min <= 15) {
// querty = `першу`;
// } else if (min>=16 && min <=30) {
// querty = `другу`;
// } else if (min=31 && min <=45) {
// querty = `третю`;
// } else {
// querty =`четверта`;
// }
// alert(`${min} входить в  ${querty} чверть`);






// Задача
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної resu
// Значення змінної result виведіть в консоль.

// Рішення

// const num = prompt("Введіть число від 1 до 4");
// let result;

// switch (num) {
//     case "1":
//     result = "зима";
//     break;

//     case "2":
//     result = "весна";
//     break;

//     case "3":
//     result = "літо";
//     break;

//     case "4":
//     result = "осінь";
//     break;

//     default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
//     break;
// }
 
// console.log(result);




// Задача
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):

// **Рішення**
// const minutes = Number(prompt("Введіть кількість хвилин"));
// const hours = Math.floor(minutes/60);
// const totalMinutes = minutes % 60;
// const formatHours = String(hours).padStart(2, `0`);
// const formatMinutes = String(totalMinutes).padStart(2, `0`);

// console.log(`${formatHours}:${formatMinutes}`);




// Задача
// // Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// Рішення

//   let i = 0;
//   while (i <= 20) {
//   console.log (i);
//   i++;
// }


// Задача
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// Рішення

// function getNumbers(min, max) {
//     let sum = 0;
// for (let i = max; i >= min; i--) {
//     console.log (i);
// if (i % 2 === 0) {
//     sum +=i;
// }
// }
// return sum;
// }

// console.log (getNumbers(1, 10));



// Задача
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// Рішення 1

// function min(a, b) {
// if (typeof a!== `number` || typeof b!== `number`) {
//    return `Not a number!`;
// }
//    return a<b ? a:b ;
// }console.log(min(10, 6));       




//  Рішення 2

// function min(a, b) {
// if (a === Number(a) && b === Number(b)) {
//  if (a < b) {
//     return `${a} найменше число`;
//  } else {
//     return `${b} найменше число`;
//  }
// } else {
//     return `Not a number!`;
// }
// }
// console.log(min(10, 7));





